hybridMultiphaseFoamV7/tutorials/DarcyFlowCases/GravityCapillarityBalance/Gravity_Capillarity_VanGenuchten/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     hybridMultiphaseFoam;

startFrom       latestTime;

startTime       0;

stopAt          writeNow; //endTime;

endTime         10000;

deltaT          0.0001;

writeControl    adjustableRunTime; 

writeInterval   25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.01;
maxAlphaCo      0.01;
maxDeltaT       0.001;

// ************************************************************************* //
